Repository: Asteria-Academy/astroidcontroller
Catalog: lib/l10n/app_*.arb
Languages: id

# connectButton
source: CONNECT
id: SAMBUNGKAN

# disconnectButton
source: DISCONNECT
id: PUTUSKAN

# remoteButton
source: REMOTE
id: KONTROL

# settingsTitle
source: SETTINGS
id: PENGATURAN

source: Haptic Feedback
id: Umpan Balik Haptic

# hapticFeedbackDesc
source: Feel button presses
id: Rasakan sentuhan tombol

# bgm
source: Background Music
id: Musik Latar

# bgmDesc
source: Keep music playing while using the app
id: Putar musik selama aplikasi digunakan

# sfx
source: Sound Effects
id: Efek Suara

# sfxDesc
source: Button clicks and interface sounds
id: Suara klik tombol dan antarmuka

source: Show Tutorial
id: Tampilkan Tutorial

# showTutorialDesc
source: Replay the app walkthrough
id: Putar ulang panduan aplikasi

source: About & Licenses
id: Tentang & Lisensi

# aboutLicensesDesc
source: App info and legal notices
id: Info aplikasi dan pemberitahuan legal

# connectedTo
source: Connected to: {deviceName}
id: Terhubung ke: {deviceName}

source: No Robot Connected
id: Robot Tidak Terhubung

# showcaseConnectTitle
source: Connect to Robot
id: Sambungkan ke Robot

# showcaseConnectDesc
source: Tap here to scan for and connect to your Astroid robot via Bluetooth.
id: Ketuk di sini untuk memindai dan terhubung ke robot Astroid Anda melalui Bluetooth.

# showcaseStatusTitle
source: Connection Status
id: Status Koneksi

# showcaseStatusDesc
source: This shows whether your robot is connected. When connected, you can access the remote control.
id: Ini menunjukkan apakah robot Anda terhubung. Saat terhubung, Anda dapat mengakses kontrol jarak jauh.

# showcaseSettingsTitle
source: Settings
id: Pengaturan

# showcaseSettingsDesc
source: Adjust app settings, toggle haptic feedback, or replay this tutorial anytime.
id: Sesuaikan pengaturan aplikasi, aktifkan/nonaktifkan umpan balik haptic, atau putar ulang tutorial ini kapan saja.

# versionLabel
source: Version {version}
id: Versi {version}

# aboutDescription
source: A remote control app for Astroid robots. Connect via Bluetooth and control your robot with intuitive controls.
id: Aplikasi kontrol jarak jauh untuk robot Astroid. Sambungkan melalui Bluetooth dan kontrol robot Anda dengan kontrol yang intuitif.

source: Language
id: Bahasa

# languageDesc
source: Change app language
id: Ubah bahasa aplikasi

# showcaseDisconnectTitle
source: Disconnect Button
id: Tombol Putuskan Koneksi

# showcaseDisconnectDesc
source: Tap here to disconnect from your robot and return to connection screen. You can replay this tutorial from Settings.
id: Ketuk di sini untuk memutuskan koneksi dari robot Anda dan kembali ke layar koneksi. Anda dapat memutar ulang tutorial ini dari Pengaturan.

# showcaseRemoteTitle
source: Remote Control
id: Kontrol Jarak Jauh

# showcaseRemoteDesc
source: Tap here to open the remote control interface and control your robot. You can replay this tutorial from Settings.
id: Ketuk di sini untuk membuka antarmuka kontrol jarak jauh dan mengontrol robot Anda. Anda dapat memutar ulang tutorial ini dari Pengaturan.

# connectScreenTitle
source: Connect to Robot
id: Sambungkan ke Robot

# connectedToDevice
source: Connected to: {deviceName}
id: Terhubung ke: {deviceName}

source: Battery: {level}%
id: Baterai: {level}%

source: Disconnect
id: Putuskan

# robotReady
source: Robot is Ready!
id: Robot Siap!

# goBackStart
source: Go back and start your adventure.
id: Kembali dan mulai petualangan Anda.

# searchingRobots
source: Searching for Astroid robots...
id: Mencari robot Astroid...

source: No Robots Found
id: Tidak Ada Robot Ditemukan

# ensureRobotOn
source: Make sure your robot is turned on and press Scan.
id: Pastikan robot Anda menyala dan tekan Pindai.

source: Scanning...
id: Memindai...

source: Scan for Robots
id: Pindai Robot

# successfullyConnected
source: Successfully connected to {deviceName}
id: Berhasil terhubung ke {deviceName}

# connectionFailed
source: Connection failed. Please try again.
id: Koneksi gagal. Silakan coba lagi.

# successfullyConnectedExclaim
source: Successfully Connected!
id: Berhasil Terhubung!

# connectedToDeviceConnecting
source: Connected to {deviceName}
id: Terhubung ke {deviceName}

# connectionFailedTitle
source: Connection Failed
id: Koneksi Gagal

# couldNotConnect
source: Could not connect to the robot.
id: Tidak dapat terhubung ke robot.

source: Go Back
id: Kembali

source: Connecting...
id: Menghubungkan...

# establishingLink
source: Establishing link with {deviceName}
id: Melakukan koneksi dengan {deviceName}

source: Cancel
id: Batal

source: Disconnecting...
id: Memutuskan koneksi...

# driveJoystick
source: Drive
id: Kendali

# headJoystick
source: Head
id: Kepala

source: Close Gripper
id: Tutup Penjepit

source: Open Gripper
id: Buka Penjepit

source: Expressions
id: Ekspresi

source: Sounds
id: Suara

source: LED Color
id: Warna LED

source: Modes
id: Mode

source: LED Control
id: Kontrol LED

# tapSegment
source: Tap a segment
id: Ketuk segmen

# selectColor
source: Select a color
id: Pilih warna

source: Set All LEDs
id: Atur Semua LED

source: Done
id: Selesai

source: Set Expression
id: Atur Ekspresi

source: Close
id: Tutup

source: Play Sound
id: Putar Suara

source: Special Modes
id: Mode Khusus

source: Line Follower
id: Pengikut Garis

source: Start/Stop
id: Mulai/Berhenti

source: Calibrate
id: Kalibrasi

source: Wonder Pack Gestures
id: Gestur Wonder Pack

source: Gripper
id: Penjepit

source: Launcher
id: Peluncur

# emergencyStop
source: E-STOP
id: BERHENTI

# btnNext
source: Next
id: Lanjutkan

# btnPrevious
source: Previous
id: Sebelumnya

# btnSkip
source: Skip
id: Lewati

# btnFinish
source: Finish
id: Selesai

# pickAColor
source: Pick a color for the LED segment.
id: Pilih warna kustom LED.

source: Select
id: Pilih

source: Upcoming Feature
id: Fitur Akan Datang
